<?php
$pageHeader = [
    'pageTitle' => 'กฎระเบียบ',
    'pageDesc' => 'กฎระเบียบและระเบียบการใช้งานเว็บไซต์ VVIP-Amulet Shop',
    'url' => 'rules.php',
    'breadcrumb' => [
        [
            'icon' => 'fa-home',
            'link' => './',
            'text' => "หน้าแรก"
        ],
        [
            'text' => "กฎระเบียบ"
        ]
    ]
];

session_start();
require_once __DIR__ . '/Tool/Connect.php';
require_once __DIR__ . '/Tool/function.php';

require_once __DIR__ . '/1_head.php';
?>

<body class="bg-darker text-white">
    <?php require_once __DIR__ . '/_header.php'; ?>
    <?php require_once __DIR__ . '/_menu.php'; ?>

    <main id="main-frame" class="container-xl">

        <article class="py-5">
            <header class="section-heading heading-line heading-line-high d-flex justify-content-between">
                <div class="title-section bg-darker d-flex align-items-baseline">
                    <div>
                        <h4>กฎระเบียบ</h4>
                        <div class="text-muted blockquote-footer mt-1 font-weight-light mb-0">ปรับปรุงล่าสุดวันที่ <?= THdatetime(date('Y-m-d H:i:s'), 'date') ?></div>
                    </div>
                </div>
            </header>
            <div class="card border-0 shadow-sm" style="background-color: rgba(0,0,0,0.25);">
                <div class="card-body">
                    <ul class="internal_link--content">
                        <li class="list" id="reg1">
                            <h3>ข้อจำกัดการอนุญาต :</h3>
                            <p>ภายใต้ระเบียบการใช้เว็บไซต์ตามสัญญานี้ เราให้สิทธิไม่เด็ดขาด ไม่อาจโอนได้ สิทธิจำกัดในการใช้และแสดงซ้ำไซต์นี้ รวมถึงข้อมูลต่างๆบนไซต์ ท่านตกลงที่จะไม่รบกวนหรือพยายามรบกวนการดำเนินงานของไซต์นี้แต่อย่างใด เราอนุญาตให้ท่านดูและนำข้อมูล (เอกสาร) ที่ปรากฏในเว็บไซต์นี้ (ไซต์) นี้ เพื่อใช้เป็นประโยชน์ส่วนตัว และไม่ใช้เพื่อเชิงพาณิชย์ การอนุญาตนี้ ไม่ถือเป็นการโอนกรรมสิทธิ์ในเอกสารและสำเนาเอกสาร อีกทั้งยังคงมีข้อห้ามดังนี้</p>
                            <ul>
                                <li>ท่านจะต้องเก็บบรรดาคำประกาศ เรื่องลิขสิทธิ์และเรื่องสิทธิอื่นๆสำหรับเอกสารเหล่านั้นไว้ด้วย</li>
                                <li>ท่านจะต้องไม่เปลี่ยนแปลงแก้ไขเอกสารหรือผลิตเพิ่มหรือแสดงเอกสารดังกล่าวในที่สาธารณะ แจกจ่าย หรือใช้ในเชิงพาณิชย์ หรือเพื่อการสาธารณะ และ</li>
                                <li>ท่านจะต้องไม่โอนเอกสารนี้ให้กับผู้อื่นใด เว้นแต่ท่านจะได้แจ้งให้บุคคลนั้นๆทราบ และบุคคลนั้นๆตกลงที่จะปฏิบัติตามระเบียบการใช้เว็บไซต์ การใช้นี้ท่านตกลงจะปฎิบัติตามข้อกำหนดเพิ่มเติมที่ปรากฎในไซต์นี้</li>
                            </ul>
                            <p>ตามที่จะมีการปรับปรุงและประกาศใช้เป็นครั้งเป็นคราวไป ท่านตกลงจะปฏิบัติตามกฎหมายลิขสิทธิ์ที่มีอยู่ตามประเทศต่างๆทั่วโลกในการใช้ไซต์นี้ และตกลงจะป้องกันไม่ไห้มีการลอกเอกสารไปใช้เมื่อไม่ได้รับอนุญาต เว้นแต่จะระบุไว้อย่างชัดเจนในที่นี้ เราไม่ได้ให้สิทธิบัตร เครื่องหมายการค้า ลิขสิทธิ์ หรือ ความลับ ทางการค้า ให้แก่ท่านแต่อย่างใด ไม่ว่าจะเป็นในรูปแบบใด</p>
                        </li>
                        <li class="list" id="reg2">
                            <h3>ข้อปฏิเสธความรับผิด :</h3>
                            <p>เอกสารนี้อาจมีข้อความที่ไม่ถูกต้องตรงความจริงหรือการสะกดตัวอักษรที่ผิด เราไม่รับรองถึงความถูกต้อง หรือความครบถ้วน ของเอกสารนี้ หรือในความน่าเชื่อถือของคำแนะนำ ความเห็น ข้อความ หรือข้อมูล ซึ่งแสดงหรือแจกจ่ายจากไซต์นี้ ท่านรับทราบว่าท่าน อาจจะเชื่อความเห็น คำแนะนำ ข้อความ บันทึก หรือข้อมูล ตามนี้ได้ แต่ด้วยความเสี่ยงของท่านเอง เราขอสงวนสิทธิโดยเด็ดขาดในการแก้ไขข้อผิดพลาดหรือข้อตกหล่นของส่วนใดส่วนหนึ่งในไซต์นี้ เราอาจจะเปลี่ยนแปลงไซต์นี้ เอกสาร และผลิตภัณฑ์ โปรแกรม การให้บริการ หรือราคา (หากมี) ในไซต์นี้เมื่อใดก็ได้ โดยไม่จำต้องมีการบอกกล่าวไซต์นี้ ข้อมูล และเอกสารในไซต์รวมถึงซอฟท์แวร์ ที่อาจจะจัดให้มีในไซต์นี้มีไว้ในสภาพที่เป็นอยู่โดยไม่มีการประกันใดๆ ไม่ว่าอย่างชัดเจน หรือที่อาจจะสันนิษฐานได้ทุกประเภท รวมถึง และไม่จำกัดเฉพาะการรับประกันของความเหมาะสม การละเมิดสิทธิ์ หรือความเหมาะสมเพื่อการใช้งานอย่างใดอย่างหนึ่ง ในเขตอำนาจศาลบางแห่งอาจจะไม่ยินยอมให้มีการยกเว้นความรับผิดสำหรับการรับประกันที่อาจซ่อนเร้นไว้ ดังนั้นข้อจำกัดข้างต้นอาจไม่ใช้บังคับกับท่าน</p>
                        </li>
                        <li class="list" id="reg3">
                            <h3>ไซต์ของบุคคลที่สาม :</h3>
                            <p>เพื่อความสะดวกของท่าน เราอาจจะจัดให้มีการเชื่อมต่อไปยังไซต์ของบุคคลอื่น ถ้าท่านใช้ไซต์เหล่านี้ท่านจะต้องออกจากไซต์นี้ หากท่านต้องการไปยังไซต์อื่น ซึ่งเชื่อมโยงอยู่ในเว็ปเพจนี้ ท่านสามารถทำได้โดยความเสี่ยงของท่านเอง และเป็นความรับผิดชอบของท่านที่จะต้องดำเนินการป้องกันการแพร่ของไวรัส หรือส่วนประกอบอื่นซึ่งอาจก่อให้เกิดความเสียหายได้ เราไม่รับรองหรือให้คำยืนยันใดๆ รวมถึงไม่ยืนยันข้อความในไซต์ที่เชื่อมโยงจากเว็บเพจนี้ และบรรดาข้อมูลต่างๆของผลิตภัณฑ์ หรือการให้บริการอื่นๆในเว็บไซต์นั้นๆ การเชื่อมโยงดังกล่าวไม่ได้หมายความว่าเราหรือสปอนเซอร์ของเว็บไซต์นี้ สลักหลังมีความเกี่ยวเนื่องหรือเป็นบริษัทในเครือหรือได้รับอำนาจตามกฎหมายในการใช้เครื่องหมายการค้า ชื่อทางการค้า เครื่องหมาย หรือเครื่องหมายลิขสิทธิ์ที่ปรากฎในไซต์ที่มีการเชื่อมต่อกัน หรือว่าไซต์ที่เชื่อมต่อดังกล่าวมีสิทธิที่จะใช้เครื่องหมายการค้า ชื่อการค้า เครื่องหมาย หรือเครื่องหมายลิขสิทธิ์แต่อย่างใด</p>
                        </li>
                        <li class="list" id="reg4">
                            <h3>ข้อมูลที่ท่านกรอก :</h3>
                            <p>ท่านตกลงว่าข้อมูลและเอกสารที่ท่านหรือบุคคลที่กระทำการแทนท่านให้กับเรา ไม่ให้ถือว่าเป็นความลับหรือเอกสิทธิส่วนบุคคล การที่ท่านให้ข้อมูลหรือเอกสารกับเรา ท่านได้ให้สิทธิแก่เราอย่างไม่จำกัด เพิกถอนไม่ได้โดยไม่คิดค่าสิทธิในการใช้ไปทั่วโลก เพื่อใช้ใหม่ แสดงในที่สาธารณะ ส่งและเผยแพร่ข้อมูลและเอกสารดังกล่าว และท่านยังตกลงว่าเรามีสิทธิอย่างสมบูรณ์ในการที่จะใช้ความคิด หลักการ หรือประดิษฐ์กรรมที่ท่านหรือตัวแทนของท่านได้ให้เรา อีกทั้งท่านยอมรับว่าเราไม่ประสงค์จะให้ท่านและท่านก็ตกลงที่จะไม่ให้ข้อมูลหรือเอกสารใดๆ ซึ่งอาจเป็นการหมิ่นประมาท ข่มขู่ อนาจาร กดขี่ หรือผิดกฎหมาย หรือข้อมูล ซึ่งประกอบด้วยข้อมูลซึ่งลิขสิทธิ์ของบุคคลอื่นรวมอยู่ด้วย</p>
                        </li>
                        <li class="list" id="reg5">
                            <h3>ข้อจำกัดเรื่องค่าเสียหาย :</h3>
                            <p>ในทุกกรณีเราหรือบริษัทในเครือ ไม่มีความรับผิดชอบต่อบุคคลใดเพื่อความเสียหายไม่ว่าโดยตรง ทางอ้อม พิเศษ ต่อเนื่อง หรือค่าเสียหายอื่นใด (รวมถึงและไม่จำกัดเฉพาะ การเสียกำไร การหยุดชะงักทางธุรกิจ การสูญเสียข้อมูล หรือโปรแกรม หรือข้อมูลอื่น ในระบบรับข้อมูลของท่าน) อันเกิดจากการใช้หรือการไม่อาจใช้ข้อมูล เอกสาร หรือฟังค์ชั่นของไซต์หรือไซต์เชื่อมโยง ถึงแม้ว่าเราได้รับแจ้งให้ทราบถึงความเสียหายที่อาจเกิดมีขึ้นจากการใช้ดังกล่าว</p>
                        </li>
                        <li class="list" id="reg6">
                            <h3>การเปลี่ยนแปลง :</h3>
                            <p>เราขอสงวนสิทธิอย่างเด็ดขาดในการที่จะเปลี่ยนแปลง แก้ไขเพิ่มหรือเอาออกซึ่งส่วนใดส่วนหนึ่งของสัญญานี้ทั้งหมด หรือเพียงบางส่วนตลอดเวลา การเปลี่ยนแปลงสัญญานี้จะมีผลเมื่อมีการแจ้งการเปลี่ยนแปลงดังกล่าว การที่ท่านยังคงใช้ไซต์นี้หลังจากมีการเปลี่ยนแปลงสัญญาให้ถือเป็นการยอมรับข้อเปลี่ยนแปลงนั้น เราอาจบอกเลิกเปลี่ยน ระงับชั่วคราว หรือเลิกใช้ไซต์นี้ รวมทั้งรูปแบบของไซต์นี้ในเวลาใดเวลาหนึ่ง เราอาจจะกำหนดขอบเขตการใช้ของรูปแบบ และการให้บริการบางประการ หรือจำกัดการใช้งานของท่านในบางส่วนหรือทั้งหมดของไซต์ โดยไม่จำต้องบอกกล่าวล่วงหน้า และโดยไม่ก่อให้เกิดความรับผิดชอบใดๆ เราอาจจะบอกเลิกการอนุญาตสิทธิและสิทธิในการใช้ซึ่งให้ไว้ในที่นี้ และเมื่อมีการบอกเลิกแล้ว ท่านจะต้องทำลายเอกสารทั้งหมดโดยทันที</p>
                        </li>
                        <li class="list" id="reg7">
                            <h3>การใช้งานระหว่างประเทศและกฎหมายบังคับใช้ :</h3>
                            <p>ไซต์นี้ควบคุม ดำเนินงาน และบริหารโดยเราจากสำนักงานในประเทศไทย เราไม่รับรองว่าเอกสารในไซต์นี้เหมาะสมหรือสามารถนำไปใช้ได้ในที่อื่นนอกประเทศไทย รวมถึงไม่รับรองว่า ไม่อาจเรียกอ่านข้อมูลได้จากประเทศซึ่งข้อความที่ปรากฎอาจจะต้องห้ามตามกฎหมาย หากท่านเข้ามาในไซต์นี้จากสถานที่นอกประเทศไทย ท่านจะต้องรับผิดชอบในการปฏิบัติตามกฎหมายท้องถิ่นทุกชนิด</p>
                        </li>
                    </ul>
                </div>
            </div>
        </article>

    </main>

    <?php require_once __DIR__ . '/2_foot.php'; ?>
</body>

</html>